NXP-MCU-X-Lab/nxp_easy_mcuboot/Project/frdm_mcxc162/mcxc162_bl/utilities/str/fsl_str.c
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
static void StrFormatExaminedi(uint32_t *flags_used, long long int *ival, va_list *ap)
#else
static void StrFormatExaminedi(int *ival, va_list *ap)
#endif
{
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
    if (0U != (*flags_used & (uint32_t)kPRINTF_LengthLongLongInt))
    {
        *ival = (long long int)va_arg(*ap, long long int);
    }
    else if (0U != (*flags_used & (uint32_t)kPRINTF_LengthLongInt))
    {
        *ival = (long long int)va_arg(*ap, long int);
    }
    else
#endif /* PRINTF_ADVANCED_ENABLE */
    {
        *ival = (STR_FORMAT_PRINTF_IVAL_TYPE)va_arg(*ap, int);
    }
}

#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
static void StrFormatExaminexX(uint32_t *flags_used, unsigned long long int *uval, va_list *ap)
#else
static void StrFormatExaminexX(unsigned int *uval, va_list *ap)
#endif
{
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
    if (0U != (*flags_used & (unsigned int)kPRINTF_LengthLongLongInt))
    {
        *uval = (unsigned long long int)va_arg(*ap, unsigned long long int);
    }
    else if (0U != (*flags_used & (unsigned int)kPRINTF_LengthLongInt))
    {
        *uval = (unsigned long long int)va_arg(*ap, unsigned long int);
    }
    else
#endif /* PRINTF_ADVANCED_ENABLE */
    {
        *uval = (STR_FORMAT_PRINTF_UVAL_TYPE)va_arg(*ap, unsigned int);
    }
}

#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
static void StrFormatExamineobpu(uint32_t *flags_used, unsigned long long int *uval, va_list *ap)
#else
static void StrFormatExamineobpu(unsigned int *uval, va_list *ap)
#endif
{
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
    if (0U != (*flags_used & (unsigned int)kPRINTF_LengthLongLongInt))
    {
        *uval = (unsigned long long int)va_arg(*ap, unsigned long long int);
    }
    else if (0U != (*flags_used & (unsigned int)kPRINTF_LengthLongInt))
    {
        *uval = (unsigned long long int)va_arg(*ap, unsigned long int);
    }
    else
#endif /* PRINTF_ADVANCED_ENABLE */
    {
        *uval = (STR_FORMAT_PRINTF_UVAL_TYPE)va_arg(*ap, unsigned int);
    }
}
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
static int32_t ConvertPrecisionWidthToLength(bool valid_precision_width, uint32_t precision_width, char *sval)
#else
static int32_t ConvertPrecisionWidthToLength(char *sval)
#endif
{
    int32_t vlen = 0;
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
    if (valid_precision_width)
    {
        vlen = (precision_width <= (uint32_t)INT32_MAX) ? (int32_t)precision_width : INT32_MAX;
    }
    else
    {
        vlen = (int32_t)strlen(sval);
    }
#else
    vlen = (int32_t)strlen(sval);
#endif /* PRINTF_ADVANCED_ENABLE */

    return vlen;
}

/*!
 * brief This function outputs its parameters according to a formatted string.
 *
 * note I/O is performed by calling given function pointer using following
 * (*func_ptr)(c);
 *
 * param[in] fmt   Format string for printf.
 * param[in] ap    Arguments to printf.
 * param[in] buf  pointer to the buffer
 * param cb print callback function pointer
 *
 * return Number of characters to be print
 */
int StrFormatPrintf(const char *fmt, va_list ap, char *buf, printfCb cb)
{
    /* va_list ap; */
    const char *p;
    char c;

    char vstr[33];
    char *vstrp  = NULL;
    int32_t vlen = 0;

    int32_t count = 0;

    uint32_t field_width;
    uint32_t precision_width;
    char *sval;
    int32_t cval;
    bool use_caps;
    unsigned int radix = 0;

#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
    uint32_t flags_used;
    char schar;
    long long int ival;
    unsigned long long int uval = 0;
    bool valid_precision_width;
#else
    int ival;
    unsigned int uval = 0;
#endif /* PRINTF_ADVANCED_ENABLE */

#if (defined(PRINTF_FLOAT_ENABLE) && (PRINTF_FLOAT_ENABLE > 0U))
    double fval;
#endif /* PRINTF_FLOAT_ENABLE */

    /* Start parsing apart the format string and display appropriate formats and data. */
    p = fmt;
    while (true)
    {
        if ('\0' == *p)
        {
            break;
        }
        c = *p;
        /*
         * All formats begin with a '%' marker.  Special chars like
         * '\n' or '\t' are normally converted to the appropriate
         * character by the __compiler__.  Thus, no need for this
         * routine to account for the '\' character.
         */
        if (c != '%')
        {
            cb(buf, &count, c, 1);
            p++;
            /* By using 'continue', the next iteration of the loop is used, skipping the code that follows. */
            continue;
        }

        use_caps = true;

#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
        /* First check for specification modifier flags. */
        flags_used = PrintCheckFlags(&p);
#endif /* PRINTF_ADVANCED_ENABLE */

        /* Next check for minimum field width. */
        field_width = PrintGetWidth(&p, &ap);

        /* Next check for the width and precision field separator. */
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
        precision_width = PrintGetPrecision(&p, &ap, &valid_precision_width);
#else
        precision_width = PrintGetPrecision(&p, &ap, NULL);
        (void)precision_width;
#endif

#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
        /* Check for the length modifier. */
        flags_used |= PrintGetLengthFlag(&p);
#else
        /* Filter length modifier. */
        PrintFilterLengthFlag(&p);
#endif

        /* Now we're ready to examine the format. */
        c = *++p;
        {
            if (1U == PrintIsdi(c))
            {
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
                StrFormatExaminedi(&flags_used, &ival, &ap);
#else
                StrFormatExaminedi(&ival, &ap);
#endif

                vlen  = ConvertRadixNumToString((char *)vstr, (void *)&ival, 1, 10, use_caps);
                vstrp = &vstr[vlen];
#if (defined(PRINTF_ADVANCED_ENABLE) && (PRINTF_ADVANCED_ENABLE > 0U))
                vlen += (int)PrintGetSignChar(ival, flags_used, &schar);
                PrintOutputdifFobpu(flags_used, field_width, (unsigned int)vlen, schar, vstrp, cb, buf, &count);
#else
                PrintOutputdifFobpu(0U, field_width, (unsigned int)vlen, '\0', vstrp, cb, buf, &count);
#endif
            }
            else if (1U == PrintIsfF(c))
            {
#if (defined(PRINTF_FLOAT_ENABLE) && (PRINTF_FLOAT_ENABLE > 0U))
                fval  = (double)va_arg(ap, double);
                vlen  = ConvertFloatRadixNumToString(vstr, &fval, 10, precision_width);
                vstrp = &vstr[vlen];

